zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
/**
 * \brief Component description for PIC32CZ/CA70 HSMCI
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_HSMCI_COMPONENT_H_
#define _PIC32CZ_CA70_HSMCI_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_HSMCI High Speed MultiMedia Card Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR HSMCI */
/* ========================================================================== */

/* -------- HSMCI_CR : (HSMCI Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t MCIEN:1;                   /**< bit:      0  Multi-Media Interface Enable                  */
    uint32_t MCIDIS:1;                  /**< bit:      1  Multi-Media Interface Disable                 */
    uint32_t PWSEN:1;                   /**< bit:      2  Power Save Mode Enable                        */
    uint32_t PWSDIS:1;                  /**< bit:      3  Power Save Mode Disable                       */
    uint32_t :3;                        /**< bit:   4..6  Reserved                                      */
    uint32_t SWRST:1;                   /**< bit:      7  Software Reset                                */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_CR_bits_t;

#define HSMCI_CR_MCIEN_Pos                    (0)                                            /**< (HSMCI_CR) Multi-Media Interface Enable Position */
#define HSMCI_CR_MCIEN_Msk                    (0x1U << HSMCI_CR_MCIEN_Pos)                   /**< (HSMCI_CR) Multi-Media Interface Enable Mask */
#define HSMCI_CR_MCIDIS_Pos                   (1)                                            /**< (HSMCI_CR) Multi-Media Interface Disable Position */
#define HSMCI_CR_MCIDIS_Msk                   (0x1U << HSMCI_CR_MCIDIS_Pos)                  /**< (HSMCI_CR) Multi-Media Interface Disable Mask */
#define HSMCI_CR_PWSEN_Pos                    (2)                                            /**< (HSMCI_CR) Power Save Mode Enable Position */
#define HSMCI_CR_PWSEN_Msk                    (0x1U << HSMCI_CR_PWSEN_Pos)                   /**< (HSMCI_CR) Power Save Mode Enable Mask */
#define HSMCI_CR_PWSDIS_Pos                   (3)                                            /**< (HSMCI_CR) Power Save Mode Disable Position */
#define HSMCI_CR_PWSDIS_Msk                   (0x1U << HSMCI_CR_PWSDIS_Pos)                  /**< (HSMCI_CR) Power Save Mode Disable Mask */
#define HSMCI_CR_SWRST_Pos                    (7)                                            /**< (HSMCI_CR) Software Reset Position */
#define HSMCI_CR_SWRST_Msk                    (0x1U << HSMCI_CR_SWRST_Pos)                   /**< (HSMCI_CR) Software Reset Mask */
#define HSMCI_CR_Msk                          (0x0000008FUL)                                 /**< (HSMCI_CR) Register Mask  */

/* -------- HSMCI_MR : (HSMCI Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t CLKDIV:8;                  /**< bit:   0..7  Clock Divider                                 */
    uint32_t PWSDIV:3;                  /**< bit:  8..10  Power Saving Divider                          */
    uint32_t RDPROOF:1;                 /**< bit:     11  Read Proof Enable                             */
    uint32_t WRPROOF:1;                 /**< bit:     12  Write Proof Enable                            */
    uint32_t FBYTE:1;                   /**< bit:     13  Force Byte Transfer                           */
    uint32_t PADV:1;                    /**< bit:     14  Padding Value                                 */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t CLKODD:1;                  /**< bit:     16  Clock divider is odd                          */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_MR_bits_t;

#define HSMCI_MR_CLKDIV_Pos                   (0)                                            /**< (HSMCI_MR) Clock Divider Position */
#define HSMCI_MR_CLKDIV_Msk                   (0xFFU << HSMCI_MR_CLKDIV_Pos)                 /**< (HSMCI_MR) Clock Divider Mask */
#define HSMCI_MR_CLKDIV(value)                (HSMCI_MR_CLKDIV_Msk & ((value) << HSMCI_MR_CLKDIV_Pos))
#define HSMCI_MR_PWSDIV_Pos                   (8)                                            /**< (HSMCI_MR) Power Saving Divider Position */
#define HSMCI_MR_PWSDIV_Msk                   (0x7U << HSMCI_MR_PWSDIV_Pos)                  /**< (HSMCI_MR) Power Saving Divider Mask */
#define HSMCI_MR_PWSDIV(value)                (HSMCI_MR_PWSDIV_Msk & ((value) << HSMCI_MR_PWSDIV_Pos))
#define HSMCI_MR_RDPROOF_Pos                  (11)                                           /**< (HSMCI_MR) Read Proof Enable Position */
#define HSMCI_MR_RDPROOF_Msk                  (0x1U << HSMCI_MR_RDPROOF_Pos)                 /**< (HSMCI_MR) Read Proof Enable Mask */
#define HSMCI_MR_WRPROOF_Pos                  (12)                                           /**< (HSMCI_MR) Write Proof Enable Position */
#define HSMCI_MR_WRPROOF_Msk                  (0x1U << HSMCI_MR_WRPROOF_Pos)                 /**< (HSMCI_MR) Write Proof Enable Mask */
#define HSMCI_MR_FBYTE_Pos                    (13)                                           /**< (HSMCI_MR) Force Byte Transfer Position */
#define HSMCI_MR_FBYTE_Msk                    (0x1U << HSMCI_MR_FBYTE_Pos)                   /**< (HSMCI_MR) Force Byte Transfer Mask */
#define HSMCI_MR_PADV_Pos                     (14)                                           /**< (HSMCI_MR) Padding Value Position */
#define HSMCI_MR_PADV_Msk                     (0x1U << HSMCI_MR_PADV_Pos)                    /**< (HSMCI_MR) Padding Value Mask */
#define HSMCI_MR_CLKODD_Pos                   (16)                                           /**< (HSMCI_MR) Clock divider is odd Position */
#define HSMCI_MR_CLKODD_Msk                   (0x1U << HSMCI_MR_CLKODD_Pos)                  /**< (HSMCI_MR) Clock divider is odd Mask */
#define HSMCI_MR_Msk                          (0x00017FFFUL)                                 /**< (HSMCI_MR) Register Mask  */

/* -------- HSMCI_DTOR : (HSMCI Offset: 0x08) (R/W 32) Data Timeout Register -------- */

typedef union
{
  struct
  {
    uint32_t DTOCYC:4;                  /**< bit:   0..3  Data Timeout Cycle Number                     */
    uint32_t DTOMUL:3;                  /**< bit:   4..6  Data Timeout Multiplier                       */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_DTOR_bits_t;

#define HSMCI_DTOR_DTOCYC_Pos                 (0)                                            /**< (HSMCI_DTOR) Data Timeout Cycle Number Position */
#define HSMCI_DTOR_DTOCYC_Msk                 (0xFU << HSMCI_DTOR_DTOCYC_Pos)                /**< (HSMCI_DTOR) Data Timeout Cycle Number Mask */
#define HSMCI_DTOR_DTOCYC(value)              (HSMCI_DTOR_DTOCYC_Msk & ((value) << HSMCI_DTOR_DTOCYC_Pos))
#define HSMCI_DTOR_DTOMUL_Pos                 (4)                                            /**< (HSMCI_DTOR) Data Timeout Multiplier Position */
#define HSMCI_DTOR_DTOMUL_Msk                 (0x7U << HSMCI_DTOR_DTOMUL_Pos)                /**< (HSMCI_DTOR) Data Timeout Multiplier Mask */
#define HSMCI_DTOR_DTOMUL(value)              (HSMCI_DTOR_DTOMUL_Msk & ((value) << HSMCI_DTOR_DTOMUL_Pos))
#define   HSMCI_DTOR_DTOMUL_1_Val             (0x0U)                                         /**< (HSMCI_DTOR) DTOCYC  */
#define   HSMCI_DTOR_DTOMUL_16_Val            (0x1U)                                         /**< (HSMCI_DTOR) DTOCYC x 16  */
#define   HSMCI_DTOR_DTOMUL_128_Val           (0x2U)                                         /**< (HSMCI_DTOR) DTOCYC x 128  */
#define   HSMCI_DTOR_DTOMUL_256_Val           (0x3U)                                         /**< (HSMCI_DTOR) DTOCYC x 256  */
#define   HSMCI_DTOR_DTOMUL_1024_Val          (0x4U)                                         /**< (HSMCI_DTOR) DTOCYC x 1024  */
#define   HSMCI_DTOR_DTOMUL_4096_Val          (0x5U)                                         /**< (HSMCI_DTOR) DTOCYC x 4096  */
#define   HSMCI_DTOR_DTOMUL_65536_Val         (0x6U)                                         /**< (HSMCI_DTOR) DTOCYC x 65536  */
#define   HSMCI_DTOR_DTOMUL_1048576_Val       (0x7U)                                         /**< (HSMCI_DTOR) DTOCYC x 1048576  */
#define HSMCI_DTOR_DTOMUL_1                   (HSMCI_DTOR_DTOMUL_1_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC Position  */
#define HSMCI_DTOR_DTOMUL_16                  (HSMCI_DTOR_DTOMUL_16_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 16 Position  */
#define HSMCI_DTOR_DTOMUL_128                 (HSMCI_DTOR_DTOMUL_128_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 128 Position  */
#define HSMCI_DTOR_DTOMUL_256                 (HSMCI_DTOR_DTOMUL_256_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 256 Position  */
#define HSMCI_DTOR_DTOMUL_1024                (HSMCI_DTOR_DTOMUL_1024_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 1024 Position  */
#define HSMCI_DTOR_DTOMUL_4096                (HSMCI_DTOR_DTOMUL_4096_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 4096 Position  */
#define HSMCI_DTOR_DTOMUL_65536               (HSMCI_DTOR_DTOMUL_65536_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 65536 Position  */
#define HSMCI_DTOR_DTOMUL_1048576             (HSMCI_DTOR_DTOMUL_1048576_Val << HSMCI_DTOR_DTOMUL_Pos)  /**< (HSMCI_DTOR) DTOCYC x 1048576 Position  */
#define HSMCI_DTOR_Msk                        (0x0000007FUL)                                 /**< (HSMCI_DTOR) Register Mask  */

/* -------- HSMCI_SDCR : (HSMCI Offset: 0x0c) (R/W 32) SD/SDIO Card Register -------- */

typedef union
{
  struct
  {
    uint32_t SDCSEL:2;                  /**< bit:   0..1  SDCard/SDIO Slot                              */
    uint32_t :4;                        /**< bit:   2..5  Reserved                                      */
    uint32_t SDCBUS:2;                  /**< bit:   6..7  SDCard/SDIO Bus Width                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_SDCR_bits_t;

