zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
#define HSMCI_RSPR_RSP_Pos                    (0)                                            /**< (HSMCI_RSPR) Response Position */
#define HSMCI_RSPR_RSP_Msk                    (0xFFFFFFFFU << HSMCI_RSPR_RSP_Pos)            /**< (HSMCI_RSPR) Response Mask */
#define HSMCI_RSPR_RSP(value)                 (HSMCI_RSPR_RSP_Msk & ((value) << HSMCI_RSPR_RSP_Pos))
#define HSMCI_RSPR_Msk                        (0xFFFFFFFFUL)                                 /**< (HSMCI_RSPR) Register Mask  */

/* -------- HSMCI_RDR : (HSMCI Offset: 0x30) (R/ 32) Receive Data Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA:32;                   /**< bit:  0..31  Data to Read                                  */
  };
  uint32_t w;
} __HSMCI_RDR_bits_t;

#define HSMCI_RDR_DATA_Pos                    (0)                                            /**< (HSMCI_RDR) Data to Read Position */
#define HSMCI_RDR_DATA_Msk                    (0xFFFFFFFFU << HSMCI_RDR_DATA_Pos)            /**< (HSMCI_RDR) Data to Read Mask */
#define HSMCI_RDR_DATA(value)                 (HSMCI_RDR_DATA_Msk & ((value) << HSMCI_RDR_DATA_Pos))
#define HSMCI_RDR_Msk                         (0xFFFFFFFFUL)                                 /**< (HSMCI_RDR) Register Mask  */

/* -------- HSMCI_TDR : (HSMCI Offset: 0x34) (/W 32) Transmit Data Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA:32;                   /**< bit:  0..31  Data to Write                                 */
  };
  uint32_t w;
} __HSMCI_TDR_bits_t;

#define HSMCI_TDR_DATA_Pos                    (0)                                            /**< (HSMCI_TDR) Data to Write Position */
#define HSMCI_TDR_DATA_Msk                    (0xFFFFFFFFU << HSMCI_TDR_DATA_Pos)            /**< (HSMCI_TDR) Data to Write Mask */
#define HSMCI_TDR_DATA(value)                 (HSMCI_TDR_DATA_Msk & ((value) << HSMCI_TDR_DATA_Pos))
#define HSMCI_TDR_Msk                         (0xFFFFFFFFUL)                                 /**< (HSMCI_TDR) Register Mask  */

/* -------- HSMCI_SR : (HSMCI Offset: 0x40) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CMDRDY:1;                  /**< bit:      0  Command Ready (cleared by writing in HSMCI_CMDR) */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready (cleared by reading HSMCI_RDR) */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Ready (cleared by writing in HSMCI_TDR) */
    uint32_t BLKE:1;                    /**< bit:      3  Data Block Ended (cleared on read)            */
    uint32_t DTIP:1;                    /**< bit:      4  Data Transfer in Progress (cleared at the end of CRC16 calculation) */
    uint32_t NOTBUSY:1;                 /**< bit:      5  HSMCI Not Busy                                */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t SDIOIRQA:1;                /**< bit:      8  SDIO Interrupt for Slot A (cleared on read)   */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t SDIOWAIT:1;                /**< bit:     12  SDIO Read Wait Operation Status               */
    uint32_t CSRCV:1;                   /**< bit:     13  CE-ATA Completion Signal Received (cleared on read) */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RINDE:1;                   /**< bit:     16  Response Index Error (cleared by writing in HSMCI_CMDR) */
    uint32_t RDIRE:1;                   /**< bit:     17  Response Direction Error (cleared by writing in HSMCI_CMDR) */
    uint32_t RCRCE:1;                   /**< bit:     18  Response CRC Error (cleared by writing in HSMCI_CMDR) */
    uint32_t RENDE:1;                   /**< bit:     19  Response End Bit Error (cleared by writing in HSMCI_CMDR) */
    uint32_t RTOE:1;                    /**< bit:     20  Response Time-out Error (cleared by writing in HSMCI_CMDR) */
    uint32_t DCRCE:1;                   /**< bit:     21  Data CRC Error (cleared on read)              */
    uint32_t DTOE:1;                    /**< bit:     22  Data Time-out Error (cleared on read)         */
    uint32_t CSTOE:1;                   /**< bit:     23  Completion Signal Time-out Error (cleared on read) */
    uint32_t BLKOVRE:1;                 /**< bit:     24  DMA Block Overrun Error (cleared on read)     */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t FIFOEMPTY:1;               /**< bit:     26  FIFO empty flag                               */
    uint32_t XFRDONE:1;                 /**< bit:     27  Transfer Done flag                            */
    uint32_t ACKRCV:1;                  /**< bit:     28  Boot Operation Acknowledge Received (cleared on read) */
    uint32_t ACKRCVE:1;                 /**< bit:     29  Boot Operation Acknowledge Error (cleared on read) */
    uint32_t OVRE:1;                    /**< bit:     30  Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) */
    uint32_t UNRE:1;                    /**< bit:     31  Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) */
  };
  uint32_t w;
} __HSMCI_SR_bits_t;

#define HSMCI_SR_CMDRDY_Pos                   (0)                                            /**< (HSMCI_SR) Command Ready (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_CMDRDY_Msk                   (0x1U << HSMCI_SR_CMDRDY_Pos)                  /**< (HSMCI_SR) Command Ready (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RXRDY_Pos                    (1)                                            /**< (HSMCI_SR) Receiver Ready (cleared by reading HSMCI_RDR) Position */
#define HSMCI_SR_RXRDY_Msk                    (0x1U << HSMCI_SR_RXRDY_Pos)                   /**< (HSMCI_SR) Receiver Ready (cleared by reading HSMCI_RDR) Mask */
#define HSMCI_SR_TXRDY_Pos                    (2)                                            /**< (HSMCI_SR) Transmit Ready (cleared by writing in HSMCI_TDR) Position */
#define HSMCI_SR_TXRDY_Msk                    (0x1U << HSMCI_SR_TXRDY_Pos)                   /**< (HSMCI_SR) Transmit Ready (cleared by writing in HSMCI_TDR) Mask */
#define HSMCI_SR_BLKE_Pos                     (3)                                            /**< (HSMCI_SR) Data Block Ended (cleared on read) Position */
#define HSMCI_SR_BLKE_Msk                     (0x1U << HSMCI_SR_BLKE_Pos)                    /**< (HSMCI_SR) Data Block Ended (cleared on read) Mask */
#define HSMCI_SR_DTIP_Pos                     (4)                                            /**< (HSMCI_SR) Data Transfer in Progress (cleared at the end of CRC16 calculation) Position */
#define HSMCI_SR_DTIP_Msk                     (0x1U << HSMCI_SR_DTIP_Pos)                    /**< (HSMCI_SR) Data Transfer in Progress (cleared at the end of CRC16 calculation) Mask */
#define HSMCI_SR_NOTBUSY_Pos                  (5)                                            /**< (HSMCI_SR) HSMCI Not Busy Position */
#define HSMCI_SR_NOTBUSY_Msk                  (0x1U << HSMCI_SR_NOTBUSY_Pos)                 /**< (HSMCI_SR) HSMCI Not Busy Mask */
#define HSMCI_SR_SDIOIRQA_Pos                 (8)                                            /**< (HSMCI_SR) SDIO Interrupt for Slot A (cleared on read) Position */
#define HSMCI_SR_SDIOIRQA_Msk                 (0x1U << HSMCI_SR_SDIOIRQA_Pos)                /**< (HSMCI_SR) SDIO Interrupt for Slot A (cleared on read) Mask */
#define HSMCI_SR_SDIOWAIT_Pos                 (12)                                           /**< (HSMCI_SR) SDIO Read Wait Operation Status Position */
#define HSMCI_SR_SDIOWAIT_Msk                 (0x1U << HSMCI_SR_SDIOWAIT_Pos)                /**< (HSMCI_SR) SDIO Read Wait Operation Status Mask */
#define HSMCI_SR_CSRCV_Pos                    (13)                                           /**< (HSMCI_SR) CE-ATA Completion Signal Received (cleared on read) Position */
#define HSMCI_SR_CSRCV_Msk                    (0x1U << HSMCI_SR_CSRCV_Pos)                   /**< (HSMCI_SR) CE-ATA Completion Signal Received (cleared on read) Mask */
#define HSMCI_SR_RINDE_Pos                    (16)                                           /**< (HSMCI_SR) Response Index Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RINDE_Msk                    (0x1U << HSMCI_SR_RINDE_Pos)                   /**< (HSMCI_SR) Response Index Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RDIRE_Pos                    (17)                                           /**< (HSMCI_SR) Response Direction Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RDIRE_Msk                    (0x1U << HSMCI_SR_RDIRE_Pos)                   /**< (HSMCI_SR) Response Direction Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RCRCE_Pos                    (18)                                           /**< (HSMCI_SR) Response CRC Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RCRCE_Msk                    (0x1U << HSMCI_SR_RCRCE_Pos)                   /**< (HSMCI_SR) Response CRC Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RENDE_Pos                    (19)                                           /**< (HSMCI_SR) Response End Bit Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RENDE_Msk                    (0x1U << HSMCI_SR_RENDE_Pos)                   /**< (HSMCI_SR) Response End Bit Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RTOE_Pos                     (20)                                           /**< (HSMCI_SR) Response Time-out Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RTOE_Msk                     (0x1U << HSMCI_SR_RTOE_Pos)                    /**< (HSMCI_SR) Response Time-out Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_DCRCE_Pos                    (21)                                           /**< (HSMCI_SR) Data CRC Error (cleared on read) Position */
#define HSMCI_SR_DCRCE_Msk                    (0x1U << HSMCI_SR_DCRCE_Pos)                   /**< (HSMCI_SR) Data CRC Error (cleared on read) Mask */
#define HSMCI_SR_DTOE_Pos                     (22)                                           /**< (HSMCI_SR) Data Time-out Error (cleared on read) Position */
#define HSMCI_SR_DTOE_Msk                     (0x1U << HSMCI_SR_DTOE_Pos)                    /**< (HSMCI_SR) Data Time-out Error (cleared on read) Mask */
#define HSMCI_SR_CSTOE_Pos                    (23)                                           /**< (HSMCI_SR) Completion Signal Time-out Error (cleared on read) Position */
#define HSMCI_SR_CSTOE_Msk                    (0x1U << HSMCI_SR_CSTOE_Pos)                   /**< (HSMCI_SR) Completion Signal Time-out Error (cleared on read) Mask */
#define HSMCI_SR_BLKOVRE_Pos                  (24)                                           /**< (HSMCI_SR) DMA Block Overrun Error (cleared on read) Position */
#define HSMCI_SR_BLKOVRE_Msk                  (0x1U << HSMCI_SR_BLKOVRE_Pos)                 /**< (HSMCI_SR) DMA Block Overrun Error (cleared on read) Mask */
#define HSMCI_SR_FIFOEMPTY_Pos                (26)                                           /**< (HSMCI_SR) FIFO empty flag Position */
#define HSMCI_SR_FIFOEMPTY_Msk                (0x1U << HSMCI_SR_FIFOEMPTY_Pos)               /**< (HSMCI_SR) FIFO empty flag Mask */
#define HSMCI_SR_XFRDONE_Pos                  (27)                                           /**< (HSMCI_SR) Transfer Done flag Position */
#define HSMCI_SR_XFRDONE_Msk                  (0x1U << HSMCI_SR_XFRDONE_Pos)                 /**< (HSMCI_SR) Transfer Done flag Mask */
#define HSMCI_SR_ACKRCV_Pos                   (28)                                           /**< (HSMCI_SR) Boot Operation Acknowledge Received (cleared on read) Position */
#define HSMCI_SR_ACKRCV_Msk                   (0x1U << HSMCI_SR_ACKRCV_Pos)                  /**< (HSMCI_SR) Boot Operation Acknowledge Received (cleared on read) Mask */
#define HSMCI_SR_ACKRCVE_Pos                  (29)                                           /**< (HSMCI_SR) Boot Operation Acknowledge Error (cleared on read) Position */
#define HSMCI_SR_ACKRCVE_Msk                  (0x1U << HSMCI_SR_ACKRCVE_Pos)                 /**< (HSMCI_SR) Boot Operation Acknowledge Error (cleared on read) Mask */
#define HSMCI_SR_OVRE_Pos                     (30)                                           /**< (HSMCI_SR) Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Position */
#define HSMCI_SR_OVRE_Msk                     (0x1U << HSMCI_SR_OVRE_Pos)                    /**< (HSMCI_SR) Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Mask */
#define HSMCI_SR_UNRE_Pos                     (31)                                           /**< (HSMCI_SR) Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Position */
#define HSMCI_SR_UNRE_Msk                     (0x1U << HSMCI_SR_UNRE_Pos)                    /**< (HSMCI_SR) Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Mask */
#define HSMCI_SR_Msk                          (0xFDFF313FUL)                                 /**< (HSMCI_SR) Register Mask  */

/* -------- HSMCI_IER : (HSMCI Offset: 0x44) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t CMDRDY:1;                  /**< bit:      0  Command Ready Interrupt Enable                */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Enable               */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Ready Interrupt Enable               */
    uint32_t BLKE:1;                    /**< bit:      3  Data Block Ended Interrupt Enable             */
    uint32_t DTIP:1;                    /**< bit:      4  Data Transfer in Progress Interrupt Enable    */
    uint32_t NOTBUSY:1;                 /**< bit:      5  Data Not Busy Interrupt Enable                */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t SDIOIRQA:1;                /**< bit:      8  SDIO Interrupt for Slot A Interrupt Enable    */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t SDIOWAIT:1;                /**< bit:     12  SDIO Read Wait Operation Status Interrupt Enable */
    uint32_t CSRCV:1;                   /**< bit:     13  Completion Signal Received Interrupt Enable   */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RINDE:1;                   /**< bit:     16  Response Index Error Interrupt Enable         */
    uint32_t RDIRE:1;                   /**< bit:     17  Response Direction Error Interrupt Enable     */
    uint32_t RCRCE:1;                   /**< bit:     18  Response CRC Error Interrupt Enable           */
    uint32_t RENDE:1;                   /**< bit:     19  Response End Bit Error Interrupt Enable       */
    uint32_t RTOE:1;                    /**< bit:     20  Response Time-out Error Interrupt Enable      */
    uint32_t DCRCE:1;                   /**< bit:     21  Data CRC Error Interrupt Enable               */
    uint32_t DTOE:1;                    /**< bit:     22  Data Time-out Error Interrupt Enable          */
    uint32_t CSTOE:1;                   /**< bit:     23  Completion Signal Timeout Error Interrupt Enable */
    uint32_t BLKOVRE:1;                 /**< bit:     24  DMA Block Overrun Error Interrupt Enable      */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t FIFOEMPTY:1;               /**< bit:     26  FIFO empty Interrupt enable                   */
    uint32_t XFRDONE:1;                 /**< bit:     27  Transfer Done Interrupt enable                */
    uint32_t ACKRCV:1;                  /**< bit:     28  Boot Acknowledge Interrupt Enable             */
    uint32_t ACKRCVE:1;                 /**< bit:     29  Boot Acknowledge Error Interrupt Enable       */
    uint32_t OVRE:1;                    /**< bit:     30  Overrun Interrupt Enable                      */
    uint32_t UNRE:1;                    /**< bit:     31  Underrun Interrupt Enable                     */
  };
  uint32_t w;
} __HSMCI_IER_bits_t;

