zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
#define HSMCI_IER_CMDRDY_Pos                  (0)                                            /**< (HSMCI_IER) Command Ready Interrupt Enable Position */
#define HSMCI_IER_CMDRDY_Msk                  (0x1U << HSMCI_IER_CMDRDY_Pos)                 /**< (HSMCI_IER) Command Ready Interrupt Enable Mask */
#define HSMCI_IER_RXRDY_Pos                   (1)                                            /**< (HSMCI_IER) Receiver Ready Interrupt Enable Position */
#define HSMCI_IER_RXRDY_Msk                   (0x1U << HSMCI_IER_RXRDY_Pos)                  /**< (HSMCI_IER) Receiver Ready Interrupt Enable Mask */
#define HSMCI_IER_TXRDY_Pos                   (2)                                            /**< (HSMCI_IER) Transmit Ready Interrupt Enable Position */
#define HSMCI_IER_TXRDY_Msk                   (0x1U << HSMCI_IER_TXRDY_Pos)                  /**< (HSMCI_IER) Transmit Ready Interrupt Enable Mask */
#define HSMCI_IER_BLKE_Pos                    (3)                                            /**< (HSMCI_IER) Data Block Ended Interrupt Enable Position */
#define HSMCI_IER_BLKE_Msk                    (0x1U << HSMCI_IER_BLKE_Pos)                   /**< (HSMCI_IER) Data Block Ended Interrupt Enable Mask */
#define HSMCI_IER_DTIP_Pos                    (4)                                            /**< (HSMCI_IER) Data Transfer in Progress Interrupt Enable Position */
#define HSMCI_IER_DTIP_Msk                    (0x1U << HSMCI_IER_DTIP_Pos)                   /**< (HSMCI_IER) Data Transfer in Progress Interrupt Enable Mask */
#define HSMCI_IER_NOTBUSY_Pos                 (5)                                            /**< (HSMCI_IER) Data Not Busy Interrupt Enable Position */
#define HSMCI_IER_NOTBUSY_Msk                 (0x1U << HSMCI_IER_NOTBUSY_Pos)                /**< (HSMCI_IER) Data Not Busy Interrupt Enable Mask */
#define HSMCI_IER_SDIOIRQA_Pos                (8)                                            /**< (HSMCI_IER) SDIO Interrupt for Slot A Interrupt Enable Position */
#define HSMCI_IER_SDIOIRQA_Msk                (0x1U << HSMCI_IER_SDIOIRQA_Pos)               /**< (HSMCI_IER) SDIO Interrupt for Slot A Interrupt Enable Mask */
#define HSMCI_IER_SDIOWAIT_Pos                (12)                                           /**< (HSMCI_IER) SDIO Read Wait Operation Status Interrupt Enable Position */
#define HSMCI_IER_SDIOWAIT_Msk                (0x1U << HSMCI_IER_SDIOWAIT_Pos)               /**< (HSMCI_IER) SDIO Read Wait Operation Status Interrupt Enable Mask */
#define HSMCI_IER_CSRCV_Pos                   (13)                                           /**< (HSMCI_IER) Completion Signal Received Interrupt Enable Position */
#define HSMCI_IER_CSRCV_Msk                   (0x1U << HSMCI_IER_CSRCV_Pos)                  /**< (HSMCI_IER) Completion Signal Received Interrupt Enable Mask */
#define HSMCI_IER_RINDE_Pos                   (16)                                           /**< (HSMCI_IER) Response Index Error Interrupt Enable Position */
#define HSMCI_IER_RINDE_Msk                   (0x1U << HSMCI_IER_RINDE_Pos)                  /**< (HSMCI_IER) Response Index Error Interrupt Enable Mask */
#define HSMCI_IER_RDIRE_Pos                   (17)                                           /**< (HSMCI_IER) Response Direction Error Interrupt Enable Position */
#define HSMCI_IER_RDIRE_Msk                   (0x1U << HSMCI_IER_RDIRE_Pos)                  /**< (HSMCI_IER) Response Direction Error Interrupt Enable Mask */
#define HSMCI_IER_RCRCE_Pos                   (18)                                           /**< (HSMCI_IER) Response CRC Error Interrupt Enable Position */
#define HSMCI_IER_RCRCE_Msk                   (0x1U << HSMCI_IER_RCRCE_Pos)                  /**< (HSMCI_IER) Response CRC Error Interrupt Enable Mask */
#define HSMCI_IER_RENDE_Pos                   (19)                                           /**< (HSMCI_IER) Response End Bit Error Interrupt Enable Position */
#define HSMCI_IER_RENDE_Msk                   (0x1U << HSMCI_IER_RENDE_Pos)                  /**< (HSMCI_IER) Response End Bit Error Interrupt Enable Mask */
#define HSMCI_IER_RTOE_Pos                    (20)                                           /**< (HSMCI_IER) Response Time-out Error Interrupt Enable Position */
#define HSMCI_IER_RTOE_Msk                    (0x1U << HSMCI_IER_RTOE_Pos)                   /**< (HSMCI_IER) Response Time-out Error Interrupt Enable Mask */
#define HSMCI_IER_DCRCE_Pos                   (21)                                           /**< (HSMCI_IER) Data CRC Error Interrupt Enable Position */
#define HSMCI_IER_DCRCE_Msk                   (0x1U << HSMCI_IER_DCRCE_Pos)                  /**< (HSMCI_IER) Data CRC Error Interrupt Enable Mask */
#define HSMCI_IER_DTOE_Pos                    (22)                                           /**< (HSMCI_IER) Data Time-out Error Interrupt Enable Position */
#define HSMCI_IER_DTOE_Msk                    (0x1U << HSMCI_IER_DTOE_Pos)                   /**< (HSMCI_IER) Data Time-out Error Interrupt Enable Mask */
#define HSMCI_IER_CSTOE_Pos                   (23)                                           /**< (HSMCI_IER) Completion Signal Timeout Error Interrupt Enable Position */
#define HSMCI_IER_CSTOE_Msk                   (0x1U << HSMCI_IER_CSTOE_Pos)                  /**< (HSMCI_IER) Completion Signal Timeout Error Interrupt Enable Mask */
#define HSMCI_IER_BLKOVRE_Pos                 (24)                                           /**< (HSMCI_IER) DMA Block Overrun Error Interrupt Enable Position */
#define HSMCI_IER_BLKOVRE_Msk                 (0x1U << HSMCI_IER_BLKOVRE_Pos)                /**< (HSMCI_IER) DMA Block Overrun Error Interrupt Enable Mask */
#define HSMCI_IER_FIFOEMPTY_Pos               (26)                                           /**< (HSMCI_IER) FIFO empty Interrupt enable Position */
#define HSMCI_IER_FIFOEMPTY_Msk               (0x1U << HSMCI_IER_FIFOEMPTY_Pos)              /**< (HSMCI_IER) FIFO empty Interrupt enable Mask */
#define HSMCI_IER_XFRDONE_Pos                 (27)                                           /**< (HSMCI_IER) Transfer Done Interrupt enable Position */
#define HSMCI_IER_XFRDONE_Msk                 (0x1U << HSMCI_IER_XFRDONE_Pos)                /**< (HSMCI_IER) Transfer Done Interrupt enable Mask */
#define HSMCI_IER_ACKRCV_Pos                  (28)                                           /**< (HSMCI_IER) Boot Acknowledge Interrupt Enable Position */
#define HSMCI_IER_ACKRCV_Msk                  (0x1U << HSMCI_IER_ACKRCV_Pos)                 /**< (HSMCI_IER) Boot Acknowledge Interrupt Enable Mask */
#define HSMCI_IER_ACKRCVE_Pos                 (29)                                           /**< (HSMCI_IER) Boot Acknowledge Error Interrupt Enable Position */
#define HSMCI_IER_ACKRCVE_Msk                 (0x1U << HSMCI_IER_ACKRCVE_Pos)                /**< (HSMCI_IER) Boot Acknowledge Error Interrupt Enable Mask */
#define HSMCI_IER_OVRE_Pos                    (30)                                           /**< (HSMCI_IER) Overrun Interrupt Enable Position */
#define HSMCI_IER_OVRE_Msk                    (0x1U << HSMCI_IER_OVRE_Pos)                   /**< (HSMCI_IER) Overrun Interrupt Enable Mask */
#define HSMCI_IER_UNRE_Pos                    (31)                                           /**< (HSMCI_IER) Underrun Interrupt Enable Position */
#define HSMCI_IER_UNRE_Msk                    (0x1U << HSMCI_IER_UNRE_Pos)                   /**< (HSMCI_IER) Underrun Interrupt Enable Mask */
#define HSMCI_IER_Msk                         (0xFDFF313FUL)                                 /**< (HSMCI_IER) Register Mask  */

/* -------- HSMCI_IDR : (HSMCI Offset: 0x48) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t CMDRDY:1;                  /**< bit:      0  Command Ready Interrupt Disable               */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Disable              */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Ready Interrupt Disable              */
    uint32_t BLKE:1;                    /**< bit:      3  Data Block Ended Interrupt Disable            */
    uint32_t DTIP:1;                    /**< bit:      4  Data Transfer in Progress Interrupt Disable   */
    uint32_t NOTBUSY:1;                 /**< bit:      5  Data Not Busy Interrupt Disable               */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t SDIOIRQA:1;                /**< bit:      8  SDIO Interrupt for Slot A Interrupt Disable   */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t SDIOWAIT:1;                /**< bit:     12  SDIO Read Wait Operation Status Interrupt Disable */
    uint32_t CSRCV:1;                   /**< bit:     13  Completion Signal received interrupt Disable  */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RINDE:1;                   /**< bit:     16  Response Index Error Interrupt Disable        */
    uint32_t RDIRE:1;                   /**< bit:     17  Response Direction Error Interrupt Disable    */
    uint32_t RCRCE:1;                   /**< bit:     18  Response CRC Error Interrupt Disable          */
    uint32_t RENDE:1;                   /**< bit:     19  Response End Bit Error Interrupt Disable      */
    uint32_t RTOE:1;                    /**< bit:     20  Response Time-out Error Interrupt Disable     */
    uint32_t DCRCE:1;                   /**< bit:     21  Data CRC Error Interrupt Disable              */
    uint32_t DTOE:1;                    /**< bit:     22  Data Time-out Error Interrupt Disable         */
    uint32_t CSTOE:1;                   /**< bit:     23  Completion Signal Time out Error Interrupt Disable */
    uint32_t BLKOVRE:1;                 /**< bit:     24  DMA Block Overrun Error Interrupt Disable     */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t FIFOEMPTY:1;               /**< bit:     26  FIFO empty Interrupt Disable                  */
    uint32_t XFRDONE:1;                 /**< bit:     27  Transfer Done Interrupt Disable               */
    uint32_t ACKRCV:1;                  /**< bit:     28  Boot Acknowledge Interrupt Disable            */
    uint32_t ACKRCVE:1;                 /**< bit:     29  Boot Acknowledge Error Interrupt Disable      */
    uint32_t OVRE:1;                    /**< bit:     30  Overrun Interrupt Disable                     */
    uint32_t UNRE:1;                    /**< bit:     31  Underrun Interrupt Disable                    */
  };
  uint32_t w;
} __HSMCI_IDR_bits_t;

