zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
#define HSMCI_IDR_CMDRDY_Pos                  (0)                                            /**< (HSMCI_IDR) Command Ready Interrupt Disable Position */
#define HSMCI_IDR_CMDRDY_Msk                  (0x1U << HSMCI_IDR_CMDRDY_Pos)                 /**< (HSMCI_IDR) Command Ready Interrupt Disable Mask */
#define HSMCI_IDR_RXRDY_Pos                   (1)                                            /**< (HSMCI_IDR) Receiver Ready Interrupt Disable Position */
#define HSMCI_IDR_RXRDY_Msk                   (0x1U << HSMCI_IDR_RXRDY_Pos)                  /**< (HSMCI_IDR) Receiver Ready Interrupt Disable Mask */
#define HSMCI_IDR_TXRDY_Pos                   (2)                                            /**< (HSMCI_IDR) Transmit Ready Interrupt Disable Position */
#define HSMCI_IDR_TXRDY_Msk                   (0x1U << HSMCI_IDR_TXRDY_Pos)                  /**< (HSMCI_IDR) Transmit Ready Interrupt Disable Mask */
#define HSMCI_IDR_BLKE_Pos                    (3)                                            /**< (HSMCI_IDR) Data Block Ended Interrupt Disable Position */
#define HSMCI_IDR_BLKE_Msk                    (0x1U << HSMCI_IDR_BLKE_Pos)                   /**< (HSMCI_IDR) Data Block Ended Interrupt Disable Mask */
#define HSMCI_IDR_DTIP_Pos                    (4)                                            /**< (HSMCI_IDR) Data Transfer in Progress Interrupt Disable Position */
#define HSMCI_IDR_DTIP_Msk                    (0x1U << HSMCI_IDR_DTIP_Pos)                   /**< (HSMCI_IDR) Data Transfer in Progress Interrupt Disable Mask */
#define HSMCI_IDR_NOTBUSY_Pos                 (5)                                            /**< (HSMCI_IDR) Data Not Busy Interrupt Disable Position */
#define HSMCI_IDR_NOTBUSY_Msk                 (0x1U << HSMCI_IDR_NOTBUSY_Pos)                /**< (HSMCI_IDR) Data Not Busy Interrupt Disable Mask */
#define HSMCI_IDR_SDIOIRQA_Pos                (8)                                            /**< (HSMCI_IDR) SDIO Interrupt for Slot A Interrupt Disable Position */
#define HSMCI_IDR_SDIOIRQA_Msk                (0x1U << HSMCI_IDR_SDIOIRQA_Pos)               /**< (HSMCI_IDR) SDIO Interrupt for Slot A Interrupt Disable Mask */
#define HSMCI_IDR_SDIOWAIT_Pos                (12)                                           /**< (HSMCI_IDR) SDIO Read Wait Operation Status Interrupt Disable Position */
#define HSMCI_IDR_SDIOWAIT_Msk                (0x1U << HSMCI_IDR_SDIOWAIT_Pos)               /**< (HSMCI_IDR) SDIO Read Wait Operation Status Interrupt Disable Mask */
#define HSMCI_IDR_CSRCV_Pos                   (13)                                           /**< (HSMCI_IDR) Completion Signal received interrupt Disable Position */
#define HSMCI_IDR_CSRCV_Msk                   (0x1U << HSMCI_IDR_CSRCV_Pos)                  /**< (HSMCI_IDR) Completion Signal received interrupt Disable Mask */
#define HSMCI_IDR_RINDE_Pos                   (16)                                           /**< (HSMCI_IDR) Response Index Error Interrupt Disable Position */
#define HSMCI_IDR_RINDE_Msk                   (0x1U << HSMCI_IDR_RINDE_Pos)                  /**< (HSMCI_IDR) Response Index Error Interrupt Disable Mask */
#define HSMCI_IDR_RDIRE_Pos                   (17)                                           /**< (HSMCI_IDR) Response Direction Error Interrupt Disable Position */
#define HSMCI_IDR_RDIRE_Msk                   (0x1U << HSMCI_IDR_RDIRE_Pos)                  /**< (HSMCI_IDR) Response Direction Error Interrupt Disable Mask */
#define HSMCI_IDR_RCRCE_Pos                   (18)                                           /**< (HSMCI_IDR) Response CRC Error Interrupt Disable Position */
#define HSMCI_IDR_RCRCE_Msk                   (0x1U << HSMCI_IDR_RCRCE_Pos)                  /**< (HSMCI_IDR) Response CRC Error Interrupt Disable Mask */
#define HSMCI_IDR_RENDE_Pos                   (19)                                           /**< (HSMCI_IDR) Response End Bit Error Interrupt Disable Position */
#define HSMCI_IDR_RENDE_Msk                   (0x1U << HSMCI_IDR_RENDE_Pos)                  /**< (HSMCI_IDR) Response End Bit Error Interrupt Disable Mask */
#define HSMCI_IDR_RTOE_Pos                    (20)                                           /**< (HSMCI_IDR) Response Time-out Error Interrupt Disable Position */
#define HSMCI_IDR_RTOE_Msk                    (0x1U << HSMCI_IDR_RTOE_Pos)                   /**< (HSMCI_IDR) Response Time-out Error Interrupt Disable Mask */
#define HSMCI_IDR_DCRCE_Pos                   (21)                                           /**< (HSMCI_IDR) Data CRC Error Interrupt Disable Position */
#define HSMCI_IDR_DCRCE_Msk                   (0x1U << HSMCI_IDR_DCRCE_Pos)                  /**< (HSMCI_IDR) Data CRC Error Interrupt Disable Mask */
#define HSMCI_IDR_DTOE_Pos                    (22)                                           /**< (HSMCI_IDR) Data Time-out Error Interrupt Disable Position */
#define HSMCI_IDR_DTOE_Msk                    (0x1U << HSMCI_IDR_DTOE_Pos)                   /**< (HSMCI_IDR) Data Time-out Error Interrupt Disable Mask */
#define HSMCI_IDR_CSTOE_Pos                   (23)                                           /**< (HSMCI_IDR) Completion Signal Time out Error Interrupt Disable Position */
#define HSMCI_IDR_CSTOE_Msk                   (0x1U << HSMCI_IDR_CSTOE_Pos)                  /**< (HSMCI_IDR) Completion Signal Time out Error Interrupt Disable Mask */
#define HSMCI_IDR_BLKOVRE_Pos                 (24)                                           /**< (HSMCI_IDR) DMA Block Overrun Error Interrupt Disable Position */
#define HSMCI_IDR_BLKOVRE_Msk                 (0x1U << HSMCI_IDR_BLKOVRE_Pos)                /**< (HSMCI_IDR) DMA Block Overrun Error Interrupt Disable Mask */
#define HSMCI_IDR_FIFOEMPTY_Pos               (26)                                           /**< (HSMCI_IDR) FIFO empty Interrupt Disable Position */
#define HSMCI_IDR_FIFOEMPTY_Msk               (0x1U << HSMCI_IDR_FIFOEMPTY_Pos)              /**< (HSMCI_IDR) FIFO empty Interrupt Disable Mask */
#define HSMCI_IDR_XFRDONE_Pos                 (27)                                           /**< (HSMCI_IDR) Transfer Done Interrupt Disable Position */
#define HSMCI_IDR_XFRDONE_Msk                 (0x1U << HSMCI_IDR_XFRDONE_Pos)                /**< (HSMCI_IDR) Transfer Done Interrupt Disable Mask */
#define HSMCI_IDR_ACKRCV_Pos                  (28)                                           /**< (HSMCI_IDR) Boot Acknowledge Interrupt Disable Position */
#define HSMCI_IDR_ACKRCV_Msk                  (0x1U << HSMCI_IDR_ACKRCV_Pos)                 /**< (HSMCI_IDR) Boot Acknowledge Interrupt Disable Mask */
#define HSMCI_IDR_ACKRCVE_Pos                 (29)                                           /**< (HSMCI_IDR) Boot Acknowledge Error Interrupt Disable Position */
#define HSMCI_IDR_ACKRCVE_Msk                 (0x1U << HSMCI_IDR_ACKRCVE_Pos)                /**< (HSMCI_IDR) Boot Acknowledge Error Interrupt Disable Mask */
#define HSMCI_IDR_OVRE_Pos                    (30)                                           /**< (HSMCI_IDR) Overrun Interrupt Disable Position */
#define HSMCI_IDR_OVRE_Msk                    (0x1U << HSMCI_IDR_OVRE_Pos)                   /**< (HSMCI_IDR) Overrun Interrupt Disable Mask */
#define HSMCI_IDR_UNRE_Pos                    (31)                                           /**< (HSMCI_IDR) Underrun Interrupt Disable Position */
#define HSMCI_IDR_UNRE_Msk                    (0x1U << HSMCI_IDR_UNRE_Pos)                   /**< (HSMCI_IDR) Underrun Interrupt Disable Mask */
#define HSMCI_IDR_Msk                         (0xFDFF313FUL)                                 /**< (HSMCI_IDR) Register Mask  */

/* -------- HSMCI_IMR : (HSMCI Offset: 0x4c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t CMDRDY:1;                  /**< bit:      0  Command Ready Interrupt Mask                  */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Mask                 */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Ready Interrupt Mask                 */
    uint32_t BLKE:1;                    /**< bit:      3  Data Block Ended Interrupt Mask               */
    uint32_t DTIP:1;                    /**< bit:      4  Data Transfer in Progress Interrupt Mask      */
    uint32_t NOTBUSY:1;                 /**< bit:      5  Data Not Busy Interrupt Mask                  */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t SDIOIRQA:1;                /**< bit:      8  SDIO Interrupt for Slot A Interrupt Mask      */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t SDIOWAIT:1;                /**< bit:     12  SDIO Read Wait Operation Status Interrupt Mask */
    uint32_t CSRCV:1;                   /**< bit:     13  Completion Signal Received Interrupt Mask     */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RINDE:1;                   /**< bit:     16  Response Index Error Interrupt Mask           */
    uint32_t RDIRE:1;                   /**< bit:     17  Response Direction Error Interrupt Mask       */
    uint32_t RCRCE:1;                   /**< bit:     18  Response CRC Error Interrupt Mask             */
    uint32_t RENDE:1;                   /**< bit:     19  Response End Bit Error Interrupt Mask         */
    uint32_t RTOE:1;                    /**< bit:     20  Response Time-out Error Interrupt Mask        */
    uint32_t DCRCE:1;                   /**< bit:     21  Data CRC Error Interrupt Mask                 */
    uint32_t DTOE:1;                    /**< bit:     22  Data Time-out Error Interrupt Mask            */
    uint32_t CSTOE:1;                   /**< bit:     23  Completion Signal Time-out Error Interrupt Mask */
    uint32_t BLKOVRE:1;                 /**< bit:     24  DMA Block Overrun Error Interrupt Mask        */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t FIFOEMPTY:1;               /**< bit:     26  FIFO Empty Interrupt Mask                     */
    uint32_t XFRDONE:1;                 /**< bit:     27  Transfer Done Interrupt Mask                  */
    uint32_t ACKRCV:1;                  /**< bit:     28  Boot Operation Acknowledge Received Interrupt Mask */
    uint32_t ACKRCVE:1;                 /**< bit:     29  Boot Operation Acknowledge Error Interrupt Mask */
    uint32_t OVRE:1;                    /**< bit:     30  Overrun Interrupt Mask                        */
    uint32_t UNRE:1;                    /**< bit:     31  Underrun Interrupt Mask                       */
  };
  uint32_t w;
} __HSMCI_IMR_bits_t;

#define HSMCI_IMR_CMDRDY_Pos                  (0)                                            /**< (HSMCI_IMR) Command Ready Interrupt Mask Position */
#define HSMCI_IMR_CMDRDY_Msk                  (0x1U << HSMCI_IMR_CMDRDY_Pos)                 /**< (HSMCI_IMR) Command Ready Interrupt Mask Mask */
#define HSMCI_IMR_RXRDY_Pos                   (1)                                            /**< (HSMCI_IMR) Receiver Ready Interrupt Mask Position */
#define HSMCI_IMR_RXRDY_Msk                   (0x1U << HSMCI_IMR_RXRDY_Pos)                  /**< (HSMCI_IMR) Receiver Ready Interrupt Mask Mask */
#define HSMCI_IMR_TXRDY_Pos                   (2)                                            /**< (HSMCI_IMR) Transmit Ready Interrupt Mask Position */
#define HSMCI_IMR_TXRDY_Msk                   (0x1U << HSMCI_IMR_TXRDY_Pos)                  /**< (HSMCI_IMR) Transmit Ready Interrupt Mask Mask */
#define HSMCI_IMR_BLKE_Pos                    (3)                                            /**< (HSMCI_IMR) Data Block Ended Interrupt Mask Position */
#define HSMCI_IMR_BLKE_Msk                    (0x1U << HSMCI_IMR_BLKE_Pos)                   /**< (HSMCI_IMR) Data Block Ended Interrupt Mask Mask */
#define HSMCI_IMR_DTIP_Pos                    (4)                                            /**< (HSMCI_IMR) Data Transfer in Progress Interrupt Mask Position */
#define HSMCI_IMR_DTIP_Msk                    (0x1U << HSMCI_IMR_DTIP_Pos)                   /**< (HSMCI_IMR) Data Transfer in Progress Interrupt Mask Mask */
#define HSMCI_IMR_NOTBUSY_Pos                 (5)                                            /**< (HSMCI_IMR) Data Not Busy Interrupt Mask Position */
#define HSMCI_IMR_NOTBUSY_Msk                 (0x1U << HSMCI_IMR_NOTBUSY_Pos)                /**< (HSMCI_IMR) Data Not Busy Interrupt Mask Mask */
#define HSMCI_IMR_SDIOIRQA_Pos                (8)                                            /**< (HSMCI_IMR) SDIO Interrupt for Slot A Interrupt Mask Position */
#define HSMCI_IMR_SDIOIRQA_Msk                (0x1U << HSMCI_IMR_SDIOIRQA_Pos)               /**< (HSMCI_IMR) SDIO Interrupt for Slot A Interrupt Mask Mask */
#define HSMCI_IMR_SDIOWAIT_Pos                (12)                                           /**< (HSMCI_IMR) SDIO Read Wait Operation Status Interrupt Mask Position */
#define HSMCI_IMR_SDIOWAIT_Msk                (0x1U << HSMCI_IMR_SDIOWAIT_Pos)               /**< (HSMCI_IMR) SDIO Read Wait Operation Status Interrupt Mask Mask */
#define HSMCI_IMR_CSRCV_Pos                   (13)                                           /**< (HSMCI_IMR) Completion Signal Received Interrupt Mask Position */
#define HSMCI_IMR_CSRCV_Msk                   (0x1U << HSMCI_IMR_CSRCV_Pos)                  /**< (HSMCI_IMR) Completion Signal Received Interrupt Mask Mask */
#define HSMCI_IMR_RINDE_Pos                   (16)                                           /**< (HSMCI_IMR) Response Index Error Interrupt Mask Position */
#define HSMCI_IMR_RINDE_Msk                   (0x1U << HSMCI_IMR_RINDE_Pos)                  /**< (HSMCI_IMR) Response Index Error Interrupt Mask Mask */
#define HSMCI_IMR_RDIRE_Pos                   (17)                                           /**< (HSMCI_IMR) Response Direction Error Interrupt Mask Position */
#define HSMCI_IMR_RDIRE_Msk                   (0x1U << HSMCI_IMR_RDIRE_Pos)                  /**< (HSMCI_IMR) Response Direction Error Interrupt Mask Mask */
#define HSMCI_IMR_RCRCE_Pos                   (18)                                           /**< (HSMCI_IMR) Response CRC Error Interrupt Mask Position */
#define HSMCI_IMR_RCRCE_Msk                   (0x1U << HSMCI_IMR_RCRCE_Pos)                  /**< (HSMCI_IMR) Response CRC Error Interrupt Mask Mask */
#define HSMCI_IMR_RENDE_Pos                   (19)                                           /**< (HSMCI_IMR) Response End Bit Error Interrupt Mask Position */
#define HSMCI_IMR_RENDE_Msk                   (0x1U << HSMCI_IMR_RENDE_Pos)                  /**< (HSMCI_IMR) Response End Bit Error Interrupt Mask Mask */
#define HSMCI_IMR_RTOE_Pos                    (20)                                           /**< (HSMCI_IMR) Response Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_RTOE_Msk                    (0x1U << HSMCI_IMR_RTOE_Pos)                   /**< (HSMCI_IMR) Response Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_DCRCE_Pos                   (21)                                           /**< (HSMCI_IMR) Data CRC Error Interrupt Mask Position */
#define HSMCI_IMR_DCRCE_Msk                   (0x1U << HSMCI_IMR_DCRCE_Pos)                  /**< (HSMCI_IMR) Data CRC Error Interrupt Mask Mask */
#define HSMCI_IMR_DTOE_Pos                    (22)                                           /**< (HSMCI_IMR) Data Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_DTOE_Msk                    (0x1U << HSMCI_IMR_DTOE_Pos)                   /**< (HSMCI_IMR) Data Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_CSTOE_Pos                   (23)                                           /**< (HSMCI_IMR) Completion Signal Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_CSTOE_Msk                   (0x1U << HSMCI_IMR_CSTOE_Pos)                  /**< (HSMCI_IMR) Completion Signal Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_BLKOVRE_Pos                 (24)                                           /**< (HSMCI_IMR) DMA Block Overrun Error Interrupt Mask Position */
#define HSMCI_IMR_BLKOVRE_Msk                 (0x1U << HSMCI_IMR_BLKOVRE_Pos)                /**< (HSMCI_IMR) DMA Block Overrun Error Interrupt Mask Mask */
#define HSMCI_IMR_FIFOEMPTY_Pos               (26)                                           /**< (HSMCI_IMR) FIFO Empty Interrupt Mask Position */
#define HSMCI_IMR_FIFOEMPTY_Msk               (0x1U << HSMCI_IMR_FIFOEMPTY_Pos)              /**< (HSMCI_IMR) FIFO Empty Interrupt Mask Mask */
#define HSMCI_IMR_XFRDONE_Pos                 (27)                                           /**< (HSMCI_IMR) Transfer Done Interrupt Mask Position */
#define HSMCI_IMR_XFRDONE_Msk                 (0x1U << HSMCI_IMR_XFRDONE_Pos)                /**< (HSMCI_IMR) Transfer Done Interrupt Mask Mask */
#define HSMCI_IMR_ACKRCV_Pos                  (28)                                           /**< (HSMCI_IMR) Boot Operation Acknowledge Received Interrupt Mask Position */
#define HSMCI_IMR_ACKRCV_Msk                  (0x1U << HSMCI_IMR_ACKRCV_Pos)                 /**< (HSMCI_IMR) Boot Operation Acknowledge Received Interrupt Mask Mask */
#define HSMCI_IMR_ACKRCVE_Pos                 (29)                                           /**< (HSMCI_IMR) Boot Operation Acknowledge Error Interrupt Mask Position */
#define HSMCI_IMR_ACKRCVE_Msk                 (0x1U << HSMCI_IMR_ACKRCVE_Pos)                /**< (HSMCI_IMR) Boot Operation Acknowledge Error Interrupt Mask Mask */
#define HSMCI_IMR_OVRE_Pos                    (30)                                           /**< (HSMCI_IMR) Overrun Interrupt Mask Position */
#define HSMCI_IMR_OVRE_Msk                    (0x1U << HSMCI_IMR_OVRE_Pos)                   /**< (HSMCI_IMR) Overrun Interrupt Mask Mask */
#define HSMCI_IMR_UNRE_Pos                    (31)                                           /**< (HSMCI_IMR) Underrun Interrupt Mask Position */
#define HSMCI_IMR_UNRE_Msk                    (0x1U << HSMCI_IMR_UNRE_Pos)                   /**< (HSMCI_IMR) Underrun Interrupt Mask Mask */
#define HSMCI_IMR_Msk                         (0xFDFF313FUL)                                 /**< (HSMCI_IMR) Register Mask  */

/* -------- HSMCI_DMA : (HSMCI Offset: 0x50) (R/W 32) DMA Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t CHKSIZE:3;                 /**< bit:   4..6  DMA Channel Read and Write Chunk Size         */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t DMAEN:1;                   /**< bit:      8  DMA Hardware Handshaking Enable               */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_DMA_bits_t;

#define HSMCI_DMA_CHKSIZE_Pos                 (4)                                            /**< (HSMCI_DMA) DMA Channel Read and Write Chunk Size Position */
#define HSMCI_DMA_CHKSIZE_Msk                 (0x7U << HSMCI_DMA_CHKSIZE_Pos)                /**< (HSMCI_DMA) DMA Channel Read and Write Chunk Size Mask */
#define HSMCI_DMA_CHKSIZE(value)              (HSMCI_DMA_CHKSIZE_Msk & ((value) << HSMCI_DMA_CHKSIZE_Pos))
#define   HSMCI_DMA_CHKSIZE_1_Val             (0x0U)                                         /**< (HSMCI_DMA) 1 data available  */
#define   HSMCI_DMA_CHKSIZE_2_Val             (0x1U)                                         /**< (HSMCI_DMA) 2 data available  */
#define   HSMCI_DMA_CHKSIZE_4_Val             (0x2U)                                         /**< (HSMCI_DMA) 4 data available  */
#define   HSMCI_DMA_CHKSIZE_8_Val             (0x3U)                                         /**< (HSMCI_DMA) 8 data available  */
#define   HSMCI_DMA_CHKSIZE_16_Val            (0x4U)                                         /**< (HSMCI_DMA) 16 data available  */
#define HSMCI_DMA_CHKSIZE_1                   (HSMCI_DMA_CHKSIZE_1_Val << HSMCI_DMA_CHKSIZE_Pos)  /**< (HSMCI_DMA) 1 data available Position  */
#define HSMCI_DMA_CHKSIZE_2                   (HSMCI_DMA_CHKSIZE_2_Val << HSMCI_DMA_CHKSIZE_Pos)  /**< (HSMCI_DMA) 2 data available Position  */
#define HSMCI_DMA_CHKSIZE_4                   (HSMCI_DMA_CHKSIZE_4_Val << HSMCI_DMA_CHKSIZE_Pos)  /**< (HSMCI_DMA) 4 data available Position  */
#define HSMCI_DMA_CHKSIZE_8                   (HSMCI_DMA_CHKSIZE_8_Val << HSMCI_DMA_CHKSIZE_Pos)  /**< (HSMCI_DMA) 8 data available Position  */
#define HSMCI_DMA_CHKSIZE_16                  (HSMCI_DMA_CHKSIZE_16_Val << HSMCI_DMA_CHKSIZE_Pos)  /**< (HSMCI_DMA) 16 data available Position  */
#define HSMCI_DMA_DMAEN_Pos                   (8)                                            /**< (HSMCI_DMA) DMA Hardware Handshaking Enable Position */
#define HSMCI_DMA_DMAEN_Msk                   (0x1U << HSMCI_DMA_DMAEN_Pos)                  /**< (HSMCI_DMA) DMA Hardware Handshaking Enable Mask */
#define HSMCI_DMA_Msk                         (0x00000170UL)                                 /**< (HSMCI_DMA) Register Mask  */

