zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
/* -------- HSMCI_CFG : (HSMCI Offset: 0x54) (R/W 32) Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t FIFOMODE:1;                /**< bit:      0  HSMCI Internal FIFO control mode              */
    uint32_t :3;                        /**< bit:   1..3  Reserved                                      */
    uint32_t FERRCTRL:1;                /**< bit:      4  Flow Error flag reset control mode            */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t HSMODE:1;                  /**< bit:      8  High Speed Mode                               */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t LSYNC:1;                   /**< bit:     12  Synchronize on the last block                 */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_CFG_bits_t;

#define HSMCI_CFG_FIFOMODE_Pos                (0)                                            /**< (HSMCI_CFG) HSMCI Internal FIFO control mode Position */
#define HSMCI_CFG_FIFOMODE_Msk                (0x1U << HSMCI_CFG_FIFOMODE_Pos)               /**< (HSMCI_CFG) HSMCI Internal FIFO control mode Mask */
#define HSMCI_CFG_FERRCTRL_Pos                (4)                                            /**< (HSMCI_CFG) Flow Error flag reset control mode Position */
#define HSMCI_CFG_FERRCTRL_Msk                (0x1U << HSMCI_CFG_FERRCTRL_Pos)               /**< (HSMCI_CFG) Flow Error flag reset control mode Mask */
#define HSMCI_CFG_HSMODE_Pos                  (8)                                            /**< (HSMCI_CFG) High Speed Mode Position */
#define HSMCI_CFG_HSMODE_Msk                  (0x1U << HSMCI_CFG_HSMODE_Pos)                 /**< (HSMCI_CFG) High Speed Mode Mask */
#define HSMCI_CFG_LSYNC_Pos                   (12)                                           /**< (HSMCI_CFG) Synchronize on the last block Position */
#define HSMCI_CFG_LSYNC_Msk                   (0x1U << HSMCI_CFG_LSYNC_Pos)                  /**< (HSMCI_CFG) Synchronize on the last block Mask */
#define HSMCI_CFG_Msk                         (0x00001111UL)                                 /**< (HSMCI_CFG) Register Mask  */

/* -------- HSMCI_WPMR : (HSMCI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protect Enable                          */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protect Key                             */
  };
  uint32_t w;
} __HSMCI_WPMR_bits_t;

#define HSMCI_WPMR_WPEN_Pos                   (0)                                            /**< (HSMCI_WPMR) Write Protect Enable Position */
#define HSMCI_WPMR_WPEN_Msk                   (0x1U << HSMCI_WPMR_WPEN_Pos)                  /**< (HSMCI_WPMR) Write Protect Enable Mask */
#define HSMCI_WPMR_WPKEY_Pos                  (8)                                            /**< (HSMCI_WPMR) Write Protect Key Position */
#define HSMCI_WPMR_WPKEY_Msk                  (0xFFFFFFU << HSMCI_WPMR_WPKEY_Pos)            /**< (HSMCI_WPMR) Write Protect Key Mask */
#define HSMCI_WPMR_WPKEY(value)               (HSMCI_WPMR_WPKEY_Msk & ((value) << HSMCI_WPMR_WPKEY_Pos))
#define   HSMCI_WPMR_WPKEY_PASSWD_Val         (0x4D4349U)                                    /**< (HSMCI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define HSMCI_WPMR_WPKEY_PASSWD               (HSMCI_WPMR_WPKEY_PASSWD_Val << HSMCI_WPMR_WPKEY_Pos)  /**< (HSMCI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define HSMCI_WPMR_Msk                        (0xFFFFFF01UL)                                 /**< (HSMCI_WPMR) Register Mask  */

/* -------- HSMCI_WPSR : (HSMCI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __HSMCI_WPSR_bits_t;

#define HSMCI_WPSR_WPVS_Pos                   (0)                                            /**< (HSMCI_WPSR) Write Protection Violation Status Position */
#define HSMCI_WPSR_WPVS_Msk                   (0x1U << HSMCI_WPSR_WPVS_Pos)                  /**< (HSMCI_WPSR) Write Protection Violation Status Mask */
#define HSMCI_WPSR_WPVSRC_Pos                 (8)                                            /**< (HSMCI_WPSR) Write Protection Violation Source Position */
#define HSMCI_WPSR_WPVSRC_Msk                 (0xFFFFU << HSMCI_WPSR_WPVSRC_Pos)             /**< (HSMCI_WPSR) Write Protection Violation Source Mask */
#define HSMCI_WPSR_WPVSRC(value)              (HSMCI_WPSR_WPVSRC_Msk & ((value) << HSMCI_WPSR_WPVSRC_Pos))
#define HSMCI_WPSR_Msk                        (0x00FFFF01UL)                                 /**< (HSMCI_WPSR) Register Mask  */

/* -------- HSMCI_FIFO : (HSMCI Offset: 0x200) (R/W 32) FIFO Memory Aperture0 0 -------- */

typedef union
{
  struct
  {
    uint32_t DATA:32;                   /**< bit:  0..31  Data to Read or Data to Write                 */
  };
  uint32_t w;
} __HSMCI_FIFO_bits_t;

#define HSMCI_FIFO_DATA_Pos                   (0)                                            /**< (HSMCI_FIFO) Data to Read or Data to Write Position */
#define HSMCI_FIFO_DATA_Msk                   (0xFFFFFFFFU << HSMCI_FIFO_DATA_Pos)           /**< (HSMCI_FIFO) Data to Read or Data to Write Mask */
#define HSMCI_FIFO_DATA(value)                (HSMCI_FIFO_DATA_Msk & ((value) << HSMCI_FIFO_DATA_Pos))
#define HSMCI_FIFO_Msk                        (0xFFFFFFFFUL)                                 /**< (HSMCI_FIFO) Register Mask  */

/** \brief HSMCI register offsets definitions */
#define HSMCI_CR_OFFSET              (0x00)         /**< (HSMCI_CR) Control Register Offset */
#define HSMCI_MR_OFFSET              (0x04)         /**< (HSMCI_MR) Mode Register Offset */
#define HSMCI_DTOR_OFFSET            (0x08)         /**< (HSMCI_DTOR) Data Timeout Register Offset */
#define HSMCI_SDCR_OFFSET            (0x0C)         /**< (HSMCI_SDCR) SD/SDIO Card Register Offset */
#define HSMCI_ARGR_OFFSET            (0x10)         /**< (HSMCI_ARGR) Argument Register Offset */
#define HSMCI_CMDR_OFFSET            (0x14)         /**< (HSMCI_CMDR) Command Register Offset */
#define HSMCI_BLKR_OFFSET            (0x18)         /**< (HSMCI_BLKR) Block Register Offset */
#define HSMCI_CSTOR_OFFSET           (0x1C)         /**< (HSMCI_CSTOR) Completion Signal Timeout Register Offset */
#define HSMCI_RSPR_OFFSET            (0x20)         /**< (HSMCI_RSPR) Response Register 0 Offset */
#define HSMCI_RDR_OFFSET             (0x30)         /**< (HSMCI_RDR) Receive Data Register Offset */
#define HSMCI_TDR_OFFSET             (0x34)         /**< (HSMCI_TDR) Transmit Data Register Offset */
#define HSMCI_SR_OFFSET              (0x40)         /**< (HSMCI_SR) Status Register Offset */
#define HSMCI_IER_OFFSET             (0x44)         /**< (HSMCI_IER) Interrupt Enable Register Offset */
#define HSMCI_IDR_OFFSET             (0x48)         /**< (HSMCI_IDR) Interrupt Disable Register Offset */
#define HSMCI_IMR_OFFSET             (0x4C)         /**< (HSMCI_IMR) Interrupt Mask Register Offset */
#define HSMCI_DMA_OFFSET             (0x50)         /**< (HSMCI_DMA) DMA Configuration Register Offset */
#define HSMCI_CFG_OFFSET             (0x54)         /**< (HSMCI_CFG) Configuration Register Offset */
#define HSMCI_WPMR_OFFSET            (0xE4)         /**< (HSMCI_WPMR) Write Protection Mode Register Offset */
#define HSMCI_WPSR_OFFSET            (0xE8)         /**< (HSMCI_WPSR) Write Protection Status Register Offset */
#define HSMCI_FIFO_OFFSET            (0x200)        /**< (HSMCI_FIFO) FIFO Memory Aperture0 0 Offset */

