zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/hsmci.h
/** \brief HSMCI register API structure */
typedef struct
{
  __O   __HSMCI_CR_bits_t              HSMCI_CR;      /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __HSMCI_MR_bits_t              HSMCI_MR;      /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  __HSMCI_DTOR_bits_t            HSMCI_DTOR;    /**< Offset: 0x08 (R/W  32) Data Timeout Register */
  __IO  __HSMCI_SDCR_bits_t            HSMCI_SDCR;    /**< Offset: 0x0C (R/W  32) SD/SDIO Card Register */
  __IO  __HSMCI_ARGR_bits_t            HSMCI_ARGR;    /**< Offset: 0x10 (R/W  32) Argument Register */
  __O   __HSMCI_CMDR_bits_t            HSMCI_CMDR;    /**< Offset: 0x14 ( /W  32) Command Register */
  __IO  __HSMCI_BLKR_bits_t            HSMCI_BLKR;    /**< Offset: 0x18 (R/W  32) Block Register */
  __IO  __HSMCI_CSTOR_bits_t           HSMCI_CSTOR;   /**< Offset: 0x1C (R/W  32) Completion Signal Timeout Register */
  __I   __HSMCI_RSPR_bits_t            HSMCI_RSPR[4]; /**< Offset: 0x20 (R/   32) Response Register 0 */
  __I   __HSMCI_RDR_bits_t             HSMCI_RDR;     /**< Offset: 0x30 (R/   32) Receive Data Register */
  __O   __HSMCI_TDR_bits_t             HSMCI_TDR;     /**< Offset: 0x34 ( /W  32) Transmit Data Register */
  __I   uint8_t                        Reserved1[0x08];
  __I   __HSMCI_SR_bits_t              HSMCI_SR;      /**< Offset: 0x40 (R/   32) Status Register */
  __O   __HSMCI_IER_bits_t             HSMCI_IER;     /**< Offset: 0x44 ( /W  32) Interrupt Enable Register */
  __O   __HSMCI_IDR_bits_t             HSMCI_IDR;     /**< Offset: 0x48 ( /W  32) Interrupt Disable Register */
  __I   __HSMCI_IMR_bits_t             HSMCI_IMR;     /**< Offset: 0x4C (R/   32) Interrupt Mask Register */
  __IO  __HSMCI_DMA_bits_t             HSMCI_DMA;     /**< Offset: 0x50 (R/W  32) DMA Configuration Register */
  __IO  __HSMCI_CFG_bits_t             HSMCI_CFG;     /**< Offset: 0x54 (R/W  32) Configuration Register */
  __I   uint8_t                        Reserved2[0x8C];
  __IO  __HSMCI_WPMR_bits_t            HSMCI_WPMR;    /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __HSMCI_WPSR_bits_t            HSMCI_WPSR;    /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved3[0x114];
  __IO  __HSMCI_FIFO_bits_t            HSMCI_FIFO[256]; /**< Offset: 0x200 (R/W  32) FIFO Memory Aperture0 0 */
} hsmci_registers_t;
/** @}  end of High Speed MultiMedia Card Interface */

#endif /* _PIC32CZ_CA70_HSMCI_COMPONENT_H_ */
